INSERT INTO Organisation (nameOrg, firstNameDir, surNameDir, patronymicDir, adress, phoneNumber)
VALUES
('ООО Отлов', 'Смирнов', 'Иван', 'Андреевич', 'Ленина 38', '89237384958'),
('МирЖивотным', 'Ратыков', 'Илья', 'Сергеевич', 'Перекопская 15а', '89237384358');

INSERT INTO Municip (nameMunicip)
VALUES
('Калинский муниципальный район'),
('Центральный мениципальный район');

INSERT INTO Log (date, userLogin, id_card, operation)
VALUES
('13.05.2018', 'kurVet', 1, 'Добавление карточки в реестр'),
('19.07.2018', 'kurOtl', 1, 'Удаление карточки из реестра'),
('23.06.2019', 'operOMSU', 1, 'Изменение карточки'),
('28.12.2020', 'kurVet', 1, 'Удаление файла');

-- Запустить в новом запросе
INSERT INTO OMSU (nameOMSU,firstNameDir, surNameDir, patronymicDir, adress, phoneNumber, id_municip)
VALUES
('Калиннский административный район','имя1','фамилия1','отчество1','ленина д.5','89515556784', 1),
('Центральный административный район','имя2','фамилия2','отчество2','Республик д.5','89516456784', 2);

INSERT INTO TUser (role, id_org, login, passwordHash)
VALUES
('Оператор по отлову', 1, 'operOtl', 'f1e30885d8bfb15d355c24006f6c03af21331b0c976e1efda12a50921026af96'),
('Куратор ВетСлужбы', 2, 'kurVet', '2dfa2f91fd942d2ce908a02de291dd4f6c1370ce347aaa97f70c747a82ef1478'),
('Куратор ОМСУ', 2, 'kurOMSU', '18572d82a8e645a37cd8b155c8fa5c0b9ef8d1dab86a508251f2da1c71d1cf7b'),
('Куратор по отлову', 1, 'kurOtl', '899068f26e62ed866965daf48e0e9c59d1760652d76b950937fbca9a089a0169'),
('Оператор ВетСлужбы', 1, 'operVet', '8e0dc1dc0545b219da1ff686bc2aa90cf2faf01246ae2e6c090455bbc92181c2'),
('Оператор ОМСУ', 2, 'operOMSU', '017bd3af8b62ab91955742fcfa1bb68dbf1612fffe6836c712f3afbfc4535078'),
('Подписант ВетСлужбы', 2, 'podpisVet', '4a491a3690c6c4a409ed31aca5bbd3d958b111979d3b59d47a6d6148198cd5a5'),
('Подписант ОМСУ', 1, 'podpisOMSU', '671fecc874b8a2ce874de8e7c9470c71f4ff7584d6f967071f0bddaa4c077dd0'),
('Подписант по отлову', 2, 'podpisOtl', '3b5dd350c00c85b94cde6c27e3429238cdd82a61fdbe2247651b6e85c63a4bbd');

-- Запустить в новом запросе
INSERT INTO Card (numMK, dateMK, id_OMSU, id_municip, adressTrapping, numWorkOrder, locality, dateWorkOrder, dateTrapping, targetOrder, typeOrder, id_org, accessRoles, id_file)
VALUES
(23123, '13.05.2018', 1, 1, 'adressTrapping1', 23, 'locality1', '20.05.2018', '21.09.2012', 'targetOrder1', 'План-график', 1, '{"Оператор по отлову", "Куратор ВетСлужбы", "Куратор ОМСУ", "Подписант ОМСУ"}', NULL),
(35121, '03.11.2020', 2, 2, 'adressTrapping2', 32, 'locality2', '27.11.2020', '22.01.2022', 'targetOrder2', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(31989, '05.01.2021', 2, 2, 'adressTrapping3', 33, 'locality3', '11.01.2020', '25.11.2017', 'targetOrder3', 'План-график',  1, '{"Оператор по отлову","Подписант ВетСлужбы", "Оператор ОМСУ"}', NULL),
(54898, '19.03.2021', 1, 1, 'adressTrapping4', 42, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4', 'Заказ-наряд',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(19937, '09.02.2022', 2, 1, 'adressTrapping5', 35, 'locality5', '16.04.2021', '19.02.2020', 'targetOrder5', 'План-график',  2, '{"Оператор по отлову","Подписант по отлову", "Куратор ОМСУ"}', NULL),
(65252, '28.04.2022', 2, 2, 'adressTrapping6', 92, 'locality6', '05.03.2022', '20.01.2021', 'targetOrder6', 'План-график',  2, '{"Оператор по отлову","Куратор по отлову", "Оператор ВетСлужбы"}', );
(54898, '19.03.2021', 1, 1, 'adressTrapping4', 12, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder7', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(34897, '19.03.2021', 1, 1, 'adressTrapping4', 18, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder8', 'Заказ-наряд',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(14894, '19.03.2021', 2, 2, 'adressTrapping4', 42, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder9', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(24892, '19.03.2021', 1, 1, 'adressTrapping4', 69, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder10', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(34891, '19.03.2021', 2, 1, 'adressTrapping4', 59, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder11', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(24892, '19.03.2021', 1, 1, 'adressTrapping4', 58, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder41', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(34893, '19.03.2021', 1, 1, 'adressTrapping4', 24, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder42', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(24898, '19.03.2021', 2, 1, 'adressTrapping4', 23, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4321', 'Заказ-наряд',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(14897, '19.03.2021', 1, 1, 'adressTrapping4', 17, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4312', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(24896, '19.03.2021', 1, 1, 'adressTrapping4', 16, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4231', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(74896, '19.03.2021', 2, 1, 'adressTrapping4', 15, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(64895, '19.03.2021', 1, 1, 'adressTrapping4', 10, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(94894, '19.03.2021', 1, 1, 'adressTrapping4', 425, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(74893, '19.03.2021', 2, 2, 'adressTrapping4', 424, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(64891, '19.03.2021', 1, 1, 'adressTrapping4', 423, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'Заказ-наряд',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(54892, '19.03.2021', 2, 2, 'adressTrapping4', 422, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4321', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(44893, '19.03.2021', 1, 1, 'adressTrapping4', 412, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(34892, '19.03.2021', 2, 2, 'adressTrapping4', 432, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(24891, '19.03.2021', 1, 1, 'adressTrapping4', 412, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4123', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(14892, '19.03.2021', 2, 1, 'adressTrapping4', 422, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder454', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(24893, '19.03.2021', 1, 2, 'adressTrapping4', 422, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder445', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(34894, '19.03.2021', 1, 1, 'adressTrapping4', 92, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder479', 'Заказ-наряд',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(54896, '19.03.2021', 2, 2, 'adressTrapping4', 82, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder487', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(64895, '19.03.2021', 1, 1, 'adressTrapping4', 72, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder487', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(74894, '19.03.2021', 1, 1, 'adressTrapping4', 62, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder412', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(54893, '19.03.2021', 2, 1, 'adressTrapping4', 52, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder465', 'Заказ-наряд',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(44892, '19.03.2021', 1, 1, 'adressTrapping4', 43, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder423', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(34891, '19.03.2021', 1, 2, 'adressTrapping4', 32, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder435', 'Заказ-наряд',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(24892, '19.03.2021', 2, 1, 'adressTrapping4', 22, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder4532', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(44893, '19.03.2021', 1, 2, 'adressTrapping4', 12, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder435', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(14894, '19.03.2021', 1, 1, 'adressTrapping4', 43, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder453', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(54854, '19.03.2021', 2, 2, 'adressTrapping4', 33, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder453', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(64898, '19.03.2021', 2, 1, 'adressTrapping4', 32, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder458', 'План-график',  2, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL),
(84896, '19.03.2021', 1, 1, 'adressTrapping4', 52, 'locality4', '15.02.2021', '26.06.2016', 'targetOrder486', 'План-график',  1, '{"Оператор по отлову","Куратор ВетСлужбы", "Подписант по отлову"}', NULL)